Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: JaCoCo instruments classes to record execution coverage data. By default, the classes are instrumented on-the-fly by a Java agent. However, in Quarkus we use https://www.jacoco.org/jacoco/trunk/doc/offline.html[offline instrumentation] to modify the bytecode of classes _during build_. By default, all classes in all _application archives_ are instrumented. An _application archive_ is an archive that provides components to the application. It's indexed via Jandex, and extensions can analyze its content. For example, Quarkus is analyzing the application archives during CDI bean discovery. However, a runtime module of an extension is usually _not_ an application archive. Therefore, the extension classes were never instrumented. Until now. In Quarkus 3.31.2, we introduced new configuration properties that specify the artifacts to be instrumented: `quarkus.jacoco.instrument-artifacts."dependency-name".group-id` and `quarkus.jacoco.instrument-artifacts."dependency-name".artifact-id`.
ja_jp: JaCoCo は実行カバレッジデータを記録するためにクラスをインストゥルメントします。デフォルトでは、クラスは Java エージェントによってオンザフライでインストゥルメントされます。しかし、Quarkus では https://www.jacoco.org/jacoco/trunk/doc/offline.html[オフラインインストゥルメンテーション]を使用して、ビルド中にクラスのバイトコードを修正します。デフォルトでは、すべてのアプリケーションアーカイブ内のすべてのクラスがインストゥルメントされます。アプリケーションアーカイブとは、アプリケーションにコンポーネントを提供するアーカイブのことです。これは Jandex を介してインデックス化され、エクステンションはその内容を分析できます。例えば、Quarkus は CDI Bean の検出中にアプリケーションアーカイブを分析します。しかし、エクステンションのランタイムモジュールは通常、アプリケーションアーカイブではありません。そのため、エクステンションのクラスはインストゥルメントされませんでした。今までは。Quarkus 3.31.2 では、インストゥルメントするアーティファクトを指定する新しい設定プロパティー `quarkus.jacoco.instrument-artifacts."dependency-name".group-id` と `quarkus.jacoco.instrument-artifacts."dependency-name".artifact-id` が導入されました。

source: JaCoCo needs to be configured in your build tool.
ja_jp: Jacocoがビルドツールで設定されていること。

source: Jackson Databind support
ja_jp: Jackson Databind サポート

source: Jackson serialization support for RESTEasy
ja_jp: RESTEasy 向けの Jackson シリアライゼーションサポート

source: Jackson-specific features
ja_jp: Jackson 固有の機能

source: Jacoco needs to be configured in your build tool.
ja_jp: Jacocoは、ビルドツールで設定する必要があります。

source: Jaeger Configuration Reference
ja_jp: Jaeger構成リファレンス

source: Jaeger supports the OTel protocols out of the box since version 1.35. In this case you do not need to install the collector but can directly send the trace data to Jaeger (after enabling OTLP receivers there, see e.g. this https://medium.com/jaegertracing/introducing-native-support-for-opentelemetry-in-jaeger-eb661be8183c[blog entry]).
ja_jp: Jaegerはバージョン1.35以降、OTelプロトコルをサポートしています。この場合、コレクターをインストールする必要はなく、トレースデータを直接Jaegerに送ることができます（OTLPレシーバーを有効にした後、この link:https://medium.com/jaegertracing/introducing-native-support-for-opentelemetry-in-jaeger-eb661be8183c[ブログエントリ] を参照してください）。

source: Jaeger system just for traces.
ja_jp: トレース専用の Jaeger システム。

source: Jaeger to see traces option
ja_jp: トレースオプションを表示するための Jaeger。

source: Jaeger-all-in-one includes the Jaeger agent, an OTel collector, and the query service/UI. You do not need to install a separated collector. You can directly send the trace data to Jaeger (after enabling OTLP receivers there, see e.g. this https://medium.com/jaegertracing/introducing-native-support-for-opentelemetry-in-jaeger-eb661be8183c[blog entry] for details).
ja_jp: Jaeger-all-in-one は、Jaeger エージェント、OTel コレクター、クエリーサービス/UI を含みます。 分離型コレクターをインストールする必要はありません。トレースデータを直接 Jaeger に送ることができます (OTLP レシーバーを有効にした後、詳細はこちらの link:https://medium.com/jaegertracing/introducing-native-support-for-opentelemetry-in-jaeger-eb661be8183c[ブログエントリー] などをご覧ください）。

source: Jakarta Data requires, besides having the `hibernate-processor` annotation processor in place, one extra dependency to be added:
ja_jp: Jakarta Data では、 `hibernate-processor` アノテーションプロセッサーを配置する以外に、1 つの追加の依存関係を追加する必要があります。

source: Jakarta Persistence entity as storage of roles
ja_jp: ロールの保存先としてのjakarta Persistenceエンティティ

source: Jakarta Persistence entity specification
ja_jp: Jakarta Persistenceエンティティ仕様

source: Jakarta REST methods can be annotated with https://fasterxml.github.io/jackson-annotations/javadoc/2.10/com/fasterxml/jackson/annotation/JsonView.html[@JsonView] in order to customize the serialization of the returned POJO, on a per method-basis. This is best explained with an example.
ja_jp: Jakarta RESTメソッドに link:https://fasterxml.github.io/jackson-annotations/javadoc/2.10/com/fasterxml/jackson/annotation/JsonView.html[@JsonView] のアノテーションを付けると、メソッドごとに、返されるPOJOのシリアライズをカスタマイズすることができます。これは、例で説明するのが一番わかりやすいでしょう。

source: Jakarta REST providers
ja_jp: Jakarta RESTプロバイダー

source: Jan 01, 2016
ja_jp: 2016年1月1日

source: Jan 01, 2021
ja_jp: 2021年1月1日

source: Jandex 3 comes with a lot of improvements that will simplify the development of Quarkus extensions.
ja_jp: Jandex 3には、Quarkusエクステンションの開発を簡素化する多くの改良が加えられています。

source: Jandex Upgrade
ja_jp: Jandexアップグレード

source: Jandex, our class and annotation indexer, is at the core of Quarkus. With Quarkus 2.14, Jandex has been upgraded to the brand new Jandex 3.
ja_jp: クラスとアノテーションのインデックス作成ツールであるJandexは、Quarkusの中核を成しています。Quarkus 2.14で、Jandexは新しいJandex 3にアップグレードされました。

source: Java & Emerging AI Protocols
ja_jp: Javaと新しいAIプロトコル

source: Java 11 deprecated
ja_jp: Java 11は非推奨

source: Java 17 in generated projects
ja_jp: 生成されたプロジェクトでのJava 17

source: Java 17-based builder-images by default
ja_jp: Java 17ベースのbuilder-imagesをデフォルト化

source: Java KeyStore is used as a file-based `Vault`. Sensitive data can be imported to and securely stored in this `Vault` as Java `SecretKey` values. To use the `KeyStore` `ConfigSource` add the following managed dependency:
ja_jp: Java KeyStoreは、ファイルベースの `Vault` として使用できます。 機密データをこの `Vault` にインポートし、Java `SecretKey` 値として安全に保存することができます。 `KeyStore` `ConfigSource` を使用するには、以下のマネージド依存関係を追加します：

source: Java System Properties - `aws.accessKeyId` and `aws.secretAccessKey`
ja_jp: Javaシステムプロパティー - `aws.accessKeyId` と `aws.secretAccessKey`

source: Java Type Hover Support for Qute Templates
ja_jp: QuteテンプレートのJavaタイプホバーサポート

source: Java `enum` types
ja_jp: Java `enum` タイプ

source: Java allocates WASM memory for the policy string and input resource manifest (JSON), and writes the data to WASM memory
ja_jp: Java はポリシー文字列と入力リソースマニフェスト (JSON) 用に WASM メモリーを割り当て、データを WASM メモリーに書き込みます。

source: Java and Qute validation is included for Qute templates with Quarkus Tools for IntelliJ, including diagnostics.
ja_jp: Quarkus Tools for IntelliJを使用したQuteテンプレートには、JavaおよびQuteのバリデーションが含まれており、診断も可能です。

source: Java and Qute validation is included for Qute templates with Quarkus Tools for Visual Studio Code, including diagnostics and quick fix suggestions.
ja_jp: Quarkus Tools for Visual Studio Codeを使用したQuteテンプレートには、JavaおよびQuteの検証が含まれており、診断やクイックフィックスの提案が行われます。

source: Java applications, especially those built with Quarkus, incorporate metrics, tracing, and logs, thereby improving operational tasks. This unified telemetry enables real-time monitoring of AI pipelines and live troubleshooting.
ja_jp: Javaアプリケーション、特にQuarkusで構築されたものは、メトリクス、トレース、ログを組み込み、運用タスクを改善します。この統合されたテレメトリにより、AIパイプラインのリアルタイム監視とライブトラブルシューティングが可能になります。

source: Java brings full enterprise readiness to AI systems:
ja_jp: Javaは、AIシステムに完全なエンタープライズ対応性をもたらします。

source: Java calls `evalPolicy()` with pointers to arguments and their size
ja_jp: Java は、引数へのポインターとそのサイズを指定して `evalPolicy()` を呼び出します。

source: Java classes can also be used as input and output and must follow the Java bean convention and have a default constructor. The Java type that is declared as the parameter or return type is the type that will be expected by the Funqy runtime. Funqy does type introspection at build time to speed up boot time, so any derived types will not be noticed by the Funqy marshalling layer at runtime.
ja_jp: Javaクラスは入力と出力としても使用でき、Java Bean の規約に従う必要があり、デフォルトのコンストラクタを持たなければなりません。パラメータや戻り値の型として宣言されたJavaの型は、Funqyのランタイムが期待する型です。Funqyは起動時間を短縮するためにビルド時に型のイントロスペクションを行いますので、派生型は実行時にFunqyのマーシャリング層に意識されません。

source: Java code that relies on preview features requires special attention. To produce a native executable, this means that the `--enable-preview` flag needs to be passed to the underlying native image invocation. You can do so by prepending the flag with `-J` and passing it as additional native build argument: `-Dquarkus.native.additional-build-args=-J--enable-preview`.
ja_jp: プレビュー機能に依存する Java コードには、特別な注意が必要です。これは、ネイティブ実行可能ファイルを生成する場合、 `--enable-preview` フラグを基になるネイティブイメージ呼び出しに渡す必要があることを意味します。そのためには、フラグの前に `-J` を付け、それを追加のネイティブビルド引数として渡します: `-Dquarkus.native.additional-build-args=-J--enable-preview` 。

source: Java code that relies on preview features requires special attention. To test a native executable, this means that the `--enable-preview` flag needs to be passed to the Surefire plugin. Adding `<argLine>--enable-preview</argLine>` to its `configuration` section is one way to do so.
ja_jp: プレビュー機能に依存する Java コードには、特別な注意が必要です。 ネイティブ実行可能ファイルをテストする場合は、 `--enable-preview` フラグを Surefire プラグインに渡す必要があります。 その方法の 1 つとして、 `<argLine>--enable-preview</argLine>` をその `configuration` セクションに追加することが挙げられます。

source: Java editing improvements
ja_jp: Java編集の改善

source: Java for AI icon
ja_jp: AI向けJavaアイコン

source: Java for AI-Infused Applications and Intelligent Applications
ja_jp: AI搭載アプリケーションとインテリジェントアプリケーション向けJava

source: Java in Data Preparation
ja_jp: データ準備におけるJava

source: Java interprets the result and performs clean up
ja_jp: Java は結果を解釈し、クリーンアップを実行します。

source: Java is a language that never ceases to impress me. From its conception, to the first Java Virtual Machines with the premise of “write once run anywhere”, to Tomcat or to the Enterprise Edition standards (whether J2EE, or Java EE) it’s an ever evolving language. With the advent of containerization and the possibility of effectively managing microservices, running components that could be loaded in a "reactive" manner and the need for boot speed and efficiency, Quarkus is revealing itself as the choice for Cloud Native Java programmers.
ja_jp: Javaという言語には、いつも驚かされます。その構想から、「write once run anywhere」を前提とした最初のJava仮想マシン、Tomcat、あるいはEnterprise Editionの規格（J2EEでもJava EEでも）に至るまで、常に進化し続ける言語です。コンテナ化が進み、マイクロサービスを効果的に管理できるようになり、「リアクティブ」な方法でロードできるコンポーネントを実行し、起動速度と効率性が求められるようになったことで、QuarkusはクラウドネイティブJavaプログラマーの選択肢として登場しました。

source: Java is fun again
ja_jp: Javaが再び楽しくなりました

source: Java is ideal for AI development due to its platform independence, robust memory management, and rich open-source libraries like Deeplearning4j, Weka, and Apache Spark. Its mature ecosystem and strong community support enable scalable AI applications. With recent JVM optimizations, Java's performance handles demanding machine learning tasks and large datasets efficiently.
ja_jp: Javaは、そのプラットフォーム独立性、堅牢なメモリー管理、そしてDeeplearning4j、Weka、Apache Sparkのような豊富なオープンソースライブラリにより、AI開発に理想的です。成熟したエコシステムと強力なコミュニティサポートにより、スケーラブルなAIアプリケーションを可能にします。最近のJVM最適化により、Javaのパフォーマンスは要求の厳しい機械学習タスクと大規模なデータセットを効率的に処理します。

source: Java is used by https://www.daxx.com/blog/development-trends/number-software-developers-world[millions^] of developers worldwide and according to Redmonk, https://redmonk.com/sogrady/2021/08/05/language-rankings-6-21/[recently moved^] back to the #2 most used programming language. There are many distributions of the Java runtime and development kit, but the Eclipse Temurin (formerly known as AdoptOpenJDK) distribution has proven to be the https://snyk.io/jvm-ecosystem-report-2021/[most popular^]. Recently, the AdoptOpenJDK project was moved into the Eclipse Foundation as https://adoptium.net/[Eclipse Adoptium^]. The goal of Adoptium is to promote and support high-quality, TCK certified runtimes and associated technology for use across the Java ecosystem. It does this by performing regular builds, tests, certifications, and of course serving binaries to those millions of developers that need to evaluate, prototype, and run production workloads with Java. Like other open source Eclipse projects, the team behind the distribution API are mostly volunteers, so they are constantly looking for optimizations of their time and resources and technology used to deliver on their mission.
ja_jp: Javaは世界中で link:https://www.daxx.com/blog/development-trends/number-software-developers-world[何百万人もの^]開発者に使用されており、Redmonkによると、 link:https://redmonk.com/sogrady/2021/08/05/language-rankings-6-21/[最近^]最も使用されているプログラミング言語の第2位に link:https://redmonk.com/sogrady/2021/08/05/language-rankings-6-21/[返り咲い^]たとのことです。Javaのランタイムおよび開発キットには多くのディストリビューションがありますが、Eclipse Temurin（旧称AdoptOpenJDK）ディストリビューションが最も link:https://snyk.io/jvm-ecosystem-report-2021/[人気が^]あることがわかっています。最近、AdoptOpenJDKプロジェクトは、 link:https://adoptium.net/[Eclipse Adoptium^]としてEclipse Foundationに移されました。Adoptiumの目的は、Javaエコシステム全体で使用される高品質なTCK認証ランタイムと関連技術を促進しサポートすることです。Adoptiumは、定期的なビルド、テスト、認証、そしてもちろん、Javaを使った評価、プロトタイプ、本番ワークロードの実行を必要とする何百万人もの開発者にバイナリを提供することによってこれを行います。他のオープンソースのEclipseプロジェクトと同様に、配布APIを支えるチームはほとんどがボランティアであるため、彼らは自分たちの使命を果たすために使用する時間やリソース、技術の最適化を常に模索しています。

source: Java is used by millions of developers worldwide and is the second most popular language, and they all need a Java runtime. Adoptium, the most popular Java distribution, needed to offer a way for developers to programmatically discover and access pre-built Java binaries across many different variants, and produced an end-user API with Quarkus to improve performance and developer productivity.
ja_jp: Javaは世界中で何百万人もの開発者によって使用され、2番目に人気のある言語であり、それらはすべてJavaランタイムを必要とします。最も人気のあるJavaディストリビューションであるAdoptiumは、多くの異なるバリアントにある構築済みのJavaバイナリを開発者がプログラムで発見、アクセスする方法を提供する必要があり、パフォーマンスと開発者の生産性を向上させるためにQuarkusでエンドユーザーAPIを作成しました。

source: Java method which is called to serve a REST call
ja_jp: REST 呼び出しを処理するために呼び出される Java メソッド

source: Java preview features
ja_jp: Java プレビュー機能

source: Java primitive types
ja_jp: Java プリミティブタイプ。

source: Java runtime components, such as `javax.net.ssl.HttpsURLConnection`, rely on JSSE for SSL and TLS.
ja_jp: `javax.net.ssl.HttpsURLConnection` などの Java ランタイムコンポーネントは、SSL および TLS を JSSE に依存しています。

source: Java side of streaming data:
ja_jp: ストリーミングデータの Java 側:

source: Java version
ja_jp: Javaバージョン

source: Java, YAML, and other source files can also be referenced by AsciiDoc files.
ja_jp: JavaやYAMLなどのソースファイルをAsciiDocのファイルから参照することも可能です。

source: Java, YAML, and other source files can also be xref:doc-reference.adoc#reference-source-code[referenced] by AsciiDoc files.
ja_jp: JavaやYAMLなどのソースファイルをAsciiDocのファイルから link:doc-reference.html#reference-source-code[参照] することも可能です。

source: JavaScript request checker
ja_jp: JavaScript リクエストチェッカー

source: JavaServer Faces (jsf) is a specification for building component-based web apps in Java. It available in Quarkus, the https://quarkus.io/extensions/org.apache.myfaces.core.extensions.quarkus/myfaces-quarkus/[MyFaces] extension is an implementation of Faces for Quarkus. https://quarkus.io/extensions/io.quarkiverse.primefaces/quarkus-primefaces/[PrimeFaces] is a Faces components suite, and https://quarkus.io/extensions/io.quarkiverse.omnifaces/quarkus-omnifaces/[OmniFaces], a utility library. More information is available in https://www.melloware.com/quarkus-faces-using-jsf-with-quarkus/[this blog post].
ja_jp: JavaServer Faces (jsf) は、Java でコンポーネントベースの Web アプリケーションを構築するための仕様です。これは Quarkus で利用可能で、 https://quarkus.io/extensions/org.apache.myfaces.core.extensions.quarkus/myfaces-quarkus/[MyFaces] エクステンションは Quarkus 用の Faces の実装です。 https://quarkus.io/extensions/io.quarkiverse.primefaces/quarkus-primefaces/[PrimeFaces] は Faces コンポーネントスイートであり、 https://quarkus.io/extensions/io.quarkiverse.omnifaces/quarkus-omnifaces/[OmniFaces] はユーティリティーライブラリーです。詳細は、 https://www.melloware.com/quarkus-faces-using-jsf-with-quarkus/[このブログ投稿] を参照してください。

source: Javadoc comments discovered in MicroProfile Config source files are used to generate config reference documentation. These generated files are found in `target/asciidoc/generated/config/` (from the project root).
ja_jp: MicroProfile Config ソースファイルで発見された Javadoc コメントは、config reference ドキュメントを生成するために使用されます。これらの生成されたファイルは `target/asciidoc/generated/config/` (プロジェクトルートから) に格納されています。

source: Javascript side of streaming data:
ja_jp: ストリーミングデータの Javascript 側:

source: Java’s mature networking and concurrency capabilities make it ideal for implementing these agentic, AI-driven architectures.
ja_jp: Javaの成熟したネットワーキングと並行処理機能は、これらのエージェント的なAI駆動型アーキテクチャを実装するのに最適です。

source: Jib Options
ja_jp: Jib オプション

source: Join the Quarkus Community
ja_jp: Quarkus コミュニティへの参加

source: Join us (virtually or live) as we tour Java User Groups across the globe for 90 minutes of technical discussion, some hands-on coding and a lively Q&A tailored to each JUG’s interests.
ja_jp: 世界各地のJavaユーザーグループを訪問し、90分間の技術的なディスカッション、いくつかのハンズオンコーディング、各JUGの関心事に合わせた活発なQ&Aを行います（バーチャルまたはライブ）。

source: Join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, have a little bit more fun.
ja_jp: Quarkus が世界中の Java 開発者の生産性を向上させ、現代の傑作を生み出し、そしてもう少し楽しくなる方法を一緒に探求しましょう。

source: Joyful programming model
ja_jp: 楽しいプログラミングモデル

source: Json Schema
ja_jp: JSON スキーマ

source: Json Schema is a data serialization system. Data structures are described using schemas. The first thing we need to do is to create a schema describing the `Movie` structure. Create a file called `src/main/resources/json-schema.json` with the schema for our record (Kafka message):
ja_jp: JSON スキーマはデータのシリアライズシステムです。データ構造はスキーマを使用して記述されます。 最初に `Movie` 構造を記述するスキーマを作成する必要があります。 レコード (Kafka メッセージ) のスキーマを使用して、`src/main/resources/json-schema.json` というファイルを作成します。

source: Json Stream in NDJSON format
ja_jp: NDJSON 形式の Json ストリーム

source: Json path of Principal Name
ja_jp: プリンシパル名の Json パス

source: JsonArray (or any Java collection), either blocking or nonblocking, will return an array; otherwise, a JsonObject will be returned.
ja_jp: JsonArray (または任意の Java コレクション) は、ブロッキングまたは非ブロッキングであれば配列を返します。それ以外の場合は、JsonObject が返されます。

source: JsonObject and JsonArray
ja_jp: JsonObject および JsonArray

source: JsonRPC against a recorded value
ja_jp: 記録された値に対する JsonRPC

source: JsonRPC against the Deployment classpath
ja_jp: デプロイメントクラスパスに対する JsonRPC

source: JsonRPC against the Runtime classpath
ja_jp: ランタイムクラスパスに対する JsonRPC

source: JsonRPC in the Webcomponent (Page)
ja_jp: Web コンポーネント (ページ) 内の JsonRPC

source: JsonRpc against the deployment classpath
ja_jp: デプロイメントクラスパスに対する JsonRpc

source: Jump over to xref:datasource.adoc[Quarkus - Datasources] for all details.
ja_jp: 詳細は xref:datasource.adoc[Quarkus - データソース]をご覧ください。

source: Just a week after 1.9.1.Final, here comes 1.9.2.Final with some bugfixes and documentation improvements. Thanks a lot to everyone providing feedback and pull requests!
ja_jp: 1.9.1.Finalからちょうど一週間後、バグフィックスとドキュメントの改善を加えた1.9.2.Finalがやってきました。フィードバックとプルリクエストを提供してくださった皆様、ありがとうございました!

source: Just add a method and use annotations to describe the behavior for each call you intend to do. Then, in your resource/controller, just use the `ElementService` interface:
ja_jp: メソッドを追加し、アノテーションを使用して、実行する各呼び出しの動作を記述するだけです。次に、リソース/コントローラーで、`ElementService` インターフェースを使用します。

source: Just as you can intercept requests and responses, you can also intercept readers and writers, by extending the link:{jaxrsapi}/jakarta/ws/rs/ext/ReaderInterceptor.html[`ReaderInterceptor`] or link:{jaxrsapi}/jakarta/ws/rs/ext/WriterInterceptor.html[`WriterInterceptor`] on a class annotated with link:{jaxrsapi}/jakarta/ws/rs/ext/Provider.html[`@Provider`].
ja_jp: リクエストとレスポンスをインターセプトするのと同様に、 link:{jaxrsapi}/jakarta/ws/rs/ext/Provider.html[`@Provider`] のアノテーションがついたクラスで link:{jaxrsapi}/jakarta/ws/rs/ext/ReaderInterceptor.html[`ReaderInterceptor`] or link:{jaxrsapi}/jakarta/ws/rs/ext/WriterInterceptor.html[`WriterInterceptor`] を拡張することでリーダーとライターをインターセプトできます。

source: Just as you can intercept requests and responses, you can also intercept readers and writers, by extending the link:{jaxrsapi}/javax/ws/rs/ext/ReaderInterceptor.html[`ReaderInterceptor`] or link:{jaxrsapi}/javax/ws/rs/ext/WriterInterceptor.html[`WriterInterceptor`] on a class annotated with link:{jaxrsapi}/javax/ws/rs/ext/Provider.html[`@Provider`].
ja_jp: リクエストとレスポンスをインターセプトできるように、link:{jaxrsapi}/javax/ws/rs/ext/Provider.html[`@Provider`]でアノテーションが付けられたクラスの link:{jaxrsapi}/javax/ws/rs/ext/ReaderInterceptor.html[`ReaderInterceptor`] または link:{jaxrsapi}/javax/ws/rs/ext/WriterInterceptor.html[`WriterInterceptor`] を拡張することによってリーダーとライターをインターセプトすることもできます。

source: Just assign the transaction xref:cdi.adoc#bean-scope[scope] to such beans using the `@TransactionScoped` annotation:
ja_jp: `@TransactionScoped` アノテーションを使用して、そのようなBeanにトランザクション xref:cdi.adoc#bean-scope[scope] を 割り当てるだけです。

source: Just before my PTO, someone told me: '_I don't like magic._' In this context, _magic_ refers to the amount of hidden _stuff_ done by Quarkus under the hood for the sake of simplicity. It includes dependency injection, annotations, and so on.
ja_jp: 有休の直前に 誰かに言われました _"私はマジックが好きじゃない"_ って。この文脈では、 _マジック_ とは、シンプルにするためにQuarkusが裏側で行っている隠れた _作業_ のことを指します。これには依存性注入やアノテーションなどが含まれます。

source: Just by looking at the flamegraph and counting the number of `mmap` calls that originate in thread local allocations, an approximate estimation can be made on the RSS a Quarkus native executable uses on startup. This estimation can't be fully precise because for unaligned heap chunks, the stack trace doesn't record the size of the chunk. Also, if the additional build args are removed, inlining optimizations might obscure the type of array allocation chunk requested, so it might not be possible to decipher if the allocation is for an aligned or unaligned chunk.
ja_jp: フレームグラフを見て、スレッドのローカル割り当てを起点とする `mmap` 呼び出しの数を数えるだけで、Quarkusネイティブ実行可能ファイルが起動時に使用するRSSをおおよそ推定することができます。この推定は、完全に正確なものではありません。なぜなら、非整列ヒープチャンクの場合、スタックトレースにチャンクのサイズが記録されないからです。また、追加のビルド引数が削除された場合、インライン最適化によって要求された配列割り当てチャンクのタイプが不明瞭になり、割り当てが整列チャンクか非整列チャンクかを判断できない可能性があります。

source: Just in case you get there wondering what's the relation with https://fidoalliance.org/passkeys/[PassKeys] and whether we support it: sure, yes, PassKeys is a way that your authenticator devices can share and sync their credentials, which you can then use with our WebAuthn authentication.
ja_jp: https://fidoalliance.org/passkeys/[PassKeys] との関連について、そしてサポート対象かどうかについて気になるかもしれませんが、 もちろんこれはサポート対象です。PassKeys は、オーセンティケーターデバイスがその認証情報を共有および同期できる方法です。 認証情報は、続いて WebAuthn 認証で使用できます。

source: Just like `@ApplicationScoped` except that no client proxy is used. The instance is created when an injection point that resolves to a @Singleton bean is being injected.
ja_jp: クライアントプロキシーを使用しないことを除いて、 `@ApplicationScoped` と同じです。インスタンスは、@Singleton Beanに解決するインジェクションポイントがインジェクションされたときに生成されます。

source: Just like for any other request parameter type, you can also group them into a <<parameter-grouping,container class>>.
ja_jp: 他のリクエストパラメータータイプと同様に、これらを <<parameter-grouping,container class>> にまとめるることもできます。

source: Just like for any other request parameter type, you can also group them into a xref:parameter-grouping[container class].
ja_jp: 他のリクエストパラメータ型と同様に、 xref:parameter-grouping[コンテナクラス] にまとめることも可能です。

source: Just like in previous versions of Hibernate ORM and Hibernate Reactive with Panache, the `PanacheRepository` type comes packed with most of the operations you need to work on your entity, such as, out of the box:
ja_jp: Hibernate ORM と Hibernate Reactive with Panache の以前のバージョンと同様に、`PanacheRepository` 型には、エンティティを操作するために必要なほとんどの操作がすぐに利用できるようになっています。例えば次のとおりです。

source: Just like with Java types, when using your POJOs as keys or values, you can follow this approach:
ja_jp: Java 型の場合と同様に、POJO をキーまたは値として使用する場合は、以下のアプローチに従うことができます。

source: Just like with ``UUID``s, if your application genuinely needs `BigDecimal`, you should use it and pay the cost.
ja_jp: ``UUID`` と同様に、アプリケーションが本当に `BigDecimal` を必要とするのであれば、それを使用してコストを支払うべきです。
